
// 1. Задача на повернення ініціалів для кожного імені з масиву, посортованих в алфавітному порядку: 

// Рішення має працювати незалежно від конкретних значень в масиві імен

// const userNames = ["Петрик Ольга Іванівна", "Гнатюк Петро Антонович", "Рудко Андрій Опанасович"];
// let initials;

// // тут ваш код ...

// console.log(initials); // [ "Г.П.А.", "П.О.І.", "Р.А.О."]


 const userNames = ["Петрик Ольга Іванівна", "Гнатюк Петро Антонович", "Рудко Андрій Опанасович"];


// Напишимо ф-цію, яка перетворює імена з масиву на ініціали і потім сортує їх
// Спочатку використаємо для нашої ф-ції метод forEach — це метод масивів, який дозволяє виконати певну ф-цію один раз для кожного елементу масива
 function getSortedInitials(names) {
      // Перетворимо кожне ім'я з масиву "names" на ініціали. Для цього використаємо:
      // 1. Метод "map", який створить новий масив.
      //      Метод "map" в кожній ітерації буде брати новий об'єкт з масиву "names" і класти його в змінну "name".
      //      В 1й ітерації name = "Петрик Ольга Іванівна", в 2й name = "Гнатюк Петро Антонович" ітд
      //      Змінна "name" передається у "стрілочну" ф-цію, яка використає методи "split" і "foreach".
      // 2. Метод "split", який розіб'є змінну "name" по пробілу (' ') і покладе нові розбиті значення в масив nameParts
      //      В 1й ітерації nameParts = ["Петрик", "Ольга", "Іванівна"], в 2й nameParts = ["Гнатюк", "Петро", "Антонович"] ітд
      // 3. Метод forEach, який перебере кожен елемент нового масиву nameParts, передасть його значення в змінну part
      //      В 1й ітерації part =  "Петрик", в 2й part = "Ольга", в 3й part = "Іванівна" ітд.
      //      Змінна "part"  передається у "стрілочну" ф-цію, яка до змінної "initials" додає перший символ змінної "part" у аперкейсі
      const initials = names.map(name => {
        const nameParts = name.split(' ');
        let initials = '';
        nameParts.forEach(part => {
            initials += part[0].toUpperCase();
        });
        return initials; // Це "внутрішній реторн" з методу "map" це поки що не реторн із усієї ф-ції
    });
    return initials.sort(); // А це вже "зовнішній реторн", який повертає результат роботи усієї ф-ції  (масив відсортованих ініціалів)
 }

 console.log(getSortedInitials(userNames));

// 2. Задача на фільтрування масиву

// Реалізуйте фільтрування імен які починаються з голосної двома способами:

// через умовну конструкцію
// через вбудований метод масивів


// Рішення має працювати незалежно від конкретних значень в масиві імен

// const userNames = ['Петро', 'Емма', 'Юстин', 'Ілля', 'Марта', 'Яна', 'Василь', 'Антон', 'Олена'];
// let filteredNames;

// // тут ваш код...

// console.log(filteredNames); // ['Емма', 'Юстин', 'Ілля', 'Яна', 'Антон', 'Олена']

// 3. Задача на розворот числа:

// const currentMaxValue = 4589;
// let reverseMaxValue;

// // тут ваш код...

// console.log(reverseMaxValue); // 9854
// console.log(typeof reverseMaxValue); // 'number'

// 4. Задача на знаходження добутку масиву чисел з невідомою глибиною вкладеності:

// const resultsArray = [1, 2, [3, [4]]];
// let productOfArray;

// // тут ваш код...

// console.log(productOfArray); // 24
