// 1. Створіть 2 змінні з типом number:

let VarNum1 = 8;
let VarNum2 = -2.5;
let VarNum3 = 1_000_000;

// Проведіть з ними такі математичні операції:   

// - додавання:

VarNum1 += 3; 
concole.log(VarNum1); // 11

function sum(a, b); {
    return a + b;
}
concole.log(sum(VarNum1, VarNum2)); // 11 - 2.5 = 8.5

// - віднімання
// - множення 
// - ділення
// - зведення в ступінь однієї з них
// - знаходження квадратного кореню однієї з них 

/* 
Результат виконання кожної операції вивести через console.log
Під час виконання завдання необхідно використовувати “use strict”
*/

// 2.  Створіть змінну довільного типу:


// Проведіть наступні перетворення з нею:

// - перетворіть її на рядок

// - перетворіть її на число

// - перетворіть її на булеве значення

/*
Результат виконання кожного перетворення вивести через console.log
Під час виконання завдання необхідно використовувати “use strict”
*/
