// 1. Створіть 2 змінні з типом number:

let VarNum1 = 11;
let VarNum2 = -2.5;
let VarNum3 = 1_000_000;

// Проведіть з ними такі математичні операції:   

// - додавання:


// - віднімання
// - множення 
// - ділення
// - зведення в ступінь однієї з них
// - знаходження квадратного кореню однієї з них 

/* 
Результат виконання кожної операції вивести через console.log
Під час виконання завдання необхідно використовувати “use strict”
*/

// 2.  Створіть змінну довільного типу:


// Проведіть наступні перетворення з нею:

// - перетворіть її на рядок

// - перетворіть її на число

// - перетворіть її на булеве значення

/*
Результат виконання кожного перетворення вивести через console.log
Під час виконання завдання необхідно використовувати “use strict”
*/
